Revit 2027 API
FabricSheet.GetWireCenterlines Method
Overload List
Name | Description
GetWireCenterlines() |  Gets a list of curves representing the wires centerlines of the Fabric Sheet in the both distribution directions.
GetWireCenterlines(WireDistributionDirection) |  Gets a list of curves representing the wires centerlines of the Fabric Sheet.
Top
See Also
Reference
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace